Uni-Libraries/Uni.HAL/src/spi/uni_hal_spi_stm32h7.c
//
// Includes
//

// stdlib
#include <stddef.h>

// ST
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wstrict-aliasing"
#include <stm32h7xx_ll_bus.h>
#include <stm32h7xx_ll_dma.h>
#include <stm32h7xx_ll_spi.h>
#pragma GCC diagnostic pop

#include <FreeRTOS.h>

// uni_hal
#include "core/uni_hal_core_cm7.h"
#include "rcc/uni_hal_rcc.h"
#include "spi/uni_hal_spi.h"
#include "core/uni_hal_core_cm7.h"


//
// Globals
//

uni_hal_spi_context_t *g_uni_hal_spi_ctx[6] = {NULL};



//
// Private
//

static void _uni_hal_spi_gpio_set_alternate(uni_hal_core_periph_e spi, uni_hal_gpio_pin_context_t *gpio) {
    uni_hal_gpio_alternate_e result = UNI_HAL_GPIO_ALTERNATE_0;

    if (spi == UNI_HAL_CORE_PERIPH_SPI_3) {
        if (gpio->gpio_bank == UNI_HAL_CORE_PERIPH_GPIO_A) {
            switch (gpio->gpio_pin) {
                case UNI_HAL_GPIO_PIN_4:
                case UNI_HAL_GPIO_PIN_15:
                    result = UNI_HAL_GPIO_ALTERNATE_6;
                    break;
                default:
                    break;
            }
        } else if (gpio->gpio_bank == UNI_HAL_CORE_PERIPH_GPIO_B) {
            switch (gpio->gpio_pin) {
                case UNI_HAL_GPIO_PIN_3:
                case UNI_HAL_GPIO_PIN_4:
                    result = UNI_HAL_GPIO_ALTERNATE_6;
                    break;
                case UNI_HAL_GPIO_PIN_2:
                case UNI_HAL_GPIO_PIN_5:
                    result = UNI_HAL_GPIO_ALTERNATE_7;
                    break;
                default:
                    break;
            }
        } else if (gpio->gpio_bank == UNI_HAL_CORE_PERIPH_GPIO_C) {
            switch (gpio->gpio_pin) {
                case UNI_HAL_GPIO_PIN_10:
                case UNI_HAL_GPIO_PIN_11:
                case UNI_HAL_GPIO_PIN_12:
                    result = UNI_HAL_GPIO_ALTERNATE_6;
                    break;
                default:
                    break;
            }
        } else if (gpio->gpio_bank == UNI_HAL_CORE_PERIPH_GPIO_D) {
            switch (gpio->gpio_pin) {
                case UNI_HAL_GPIO_PIN_6:
                    result = UNI_HAL_GPIO_ALTERNATE_5;
                    break;
                default:
                    break;
            }
        }
    } else if (spi == UNI_HAL_CORE_PERIPH_SPI_4) {
        if (gpio->gpio_bank == UNI_HAL_CORE_PERIPH_GPIO_E) {
            switch (gpio->gpio_pin) {
                case UNI_HAL_GPIO_PIN_2:
                case UNI_HAL_GPIO_PIN_4:
                case UNI_HAL_GPIO_PIN_5:
                case UNI_HAL_GPIO_PIN_6:
                case UNI_HAL_GPIO_PIN_11:
                case UNI_HAL_GPIO_PIN_12:
                case UNI_HAL_GPIO_PIN_13:
                case UNI_HAL_GPIO_PIN_14:
                    result = UNI_HAL_GPIO_ALTERNATE_5;
                    break;
                default:
                    break;
            }
        }
    } else if (spi == UNI_HAL_CORE_PERIPH_SPI_5) {
        if (gpio->gpio_bank == UNI_HAL_CORE_PERIPH_GPIO_F) {
            switch (gpio->gpio_pin) {
                case UNI_HAL_GPIO_PIN_6:
                case UNI_HAL_GPIO_PIN_7:
                case UNI_HAL_GPIO_PIN_8:
                case UNI_HAL_GPIO_PIN_9:
                case UNI_HAL_GPIO_PIN_11:
                    result = UNI_HAL_GPIO_ALTERNATE_5;
                    break;
                default:
                    break;
            }
        }
        else if (gpio->gpio_bank == UNI_HAL_CORE_PERIPH_GPIO_H) {
            switch (gpio->gpio_pin) {
                case UNI_HAL_GPIO_PIN_5:
                case UNI_HAL_GPIO_PIN_6:
                case UNI_HAL_GPIO_PIN_7:
                    result = UNI_HAL_GPIO_ALTERNATE_5;
                    break;
                default:
                    break;
            }
        }
        else if (gpio->gpio_bank == UNI_HAL_CORE_PERIPH_GPIO_J) {
            switch (gpio->gpio_pin) {
                case UNI_HAL_GPIO_PIN_10:
                case UNI_HAL_GPIO_PIN_11:
                    result = UNI_HAL_GPIO_ALTERNATE_5;
                    break;
                default:
                    break;
            }
        }
        else if (gpio->gpio_bank == UNI_HAL_CORE_PERIPH_GPIO_K) {
            switch (gpio->gpio_pin) {
                case UNI_HAL_GPIO_PIN_0:
                case UNI_HAL_GPIO_PIN_1:
                    result = UNI_HAL_GPIO_ALTERNATE_5;
                    break;
                default:
                    break;
            }
        }
    }

    if (result != UNI_HAL_GPIO_ALTERNATE_0) {
        gpio->alternate = result;
    }
}

static uint32_t _uni_hal_spi_dma_request_rx_get(uni_hal_core_periph_e instance) {
    size_t result = SIZE_MAX;
    switch (instance) {
        case UNI_HAL_CORE_PERIPH_SPI_1:
            result = LL_DMAMUX1_REQ_SPI1_RX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_2:
            result = LL_DMAMUX1_REQ_SPI2_RX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_3:
            result = LL_DMAMUX1_REQ_SPI3_RX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_4:
            result = LL_DMAMUX1_REQ_SPI4_RX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_5:
            result = LL_DMAMUX1_REQ_SPI5_RX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_6:
            result = LL_DMAMUX2_REQ_SPI6_RX;
            break;
        default:
            break;
    }
    return result;
}

static uint32_t _uni_hal_spi_dma_request_tx_get(uni_hal_core_periph_e instance) {
    size_t result = SIZE_MAX;
    switch (instance) {
        case UNI_HAL_CORE_PERIPH_SPI_1:
            result = LL_DMAMUX1_REQ_SPI1_TX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_2:
            result = LL_DMAMUX1_REQ_SPI2_TX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_3:
            result = LL_DMAMUX1_REQ_SPI3_TX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_4:
            result = LL_DMAMUX1_REQ_SPI4_TX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_5:
            result = LL_DMAMUX1_REQ_SPI5_TX;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_6:
            result = LL_DMAMUX2_REQ_SPI6_TX;
            break;
        default:
            break;
    }
    return result;
}

static size_t _uni_hal_spi_index_get(uni_hal_core_periph_e instance) {
    size_t result = SIZE_MAX;
    switch (instance) {
        case UNI_HAL_CORE_PERIPH_SPI_1:
            result = 0; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_2:
            result = 1; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_3:
            result = 2; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_4:
            result = 3; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_5:
            result = 4; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_6:
            result = 5; //-V2571
            break;
        default:
            break;
    }
    return result;
}

static SPI_TypeDef *_uni_hal_spi_handle_get(uni_hal_core_periph_e instance) {
    SPI_TypeDef *result;
    switch (instance) {
        case UNI_HAL_CORE_PERIPH_SPI_1:
            result = SPI1; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_2:
            result = SPI2; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_3:
            result = SPI3; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_4:
            result = SPI4; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_5:
            result = SPI5; //-V2571
            break;
        case UNI_HAL_CORE_PERIPH_SPI_6:
            result = SPI6; //-V2571
            break;
        default:
            result = NULL;
            break;
    }
    return result;
}

static bool _uni_hal_spi_clear_flags(uni_hal_core_periph_e instance) {
    bool result = false;

    SPI_TypeDef *handle = _uni_hal_spi_handle_get(instance);
    if (handle != NULL) {
        LL_SPI_ClearFlag_OVR(handle);
        LL_SPI_ClearFlag_FRE(handle);
        LL_SPI_ClearFlag_CRCERR(handle);
        LL_SPI_ClearFlag_MODF(handle);
        LL_SPI_ClearFlag_EOT(handle);
        LL_SPI_ClearFlag_TXTF(handle);
        result = true;
    }

    return result;
}

/**
 * Convert SPI polarity to vendor speicific
 * @param polarity polarity enum value
 * @return converted value
 */
uint32_t _uni_hal_spi_phase(uni_hal_spi_cpha_e phase) {
    uint32_t result = 0;
    switch (phase) {
        case UNI_HAL_SPI_CPHA_0:
            result = LL_SPI_PHASE_1EDGE;
            break;
        case UNI_HAL_SPI_CPHA_1:
            result = LL_SPI_PHASE_2EDGE;
            break;
        default:
            // unknown phase
            break;
    }
    return result;
}


/**
 * Convert SPI polarity to vendor speicific
 * @param polarity polarity enum value
 * @return converted value
 */
uint32_t _uni_hal_spi_polarity(uni_hal_spi_cpol_e polarity) {
    uint32_t result = 0;
    switch (polarity) {
        case UNI_HAL_SPI_CPOL_0:
            result = LL_SPI_POLARITY_LOW;
            break;
        case UNI_HAL_SPI_CPOL_1:
            result = LL_SPI_POLARITY_HIGH;
            break;
        default:
            // unknown polarity
            break;
    }
    return result;
}


uint32_t _uni_hal_spi_prescaler(uni_hal_spi_prescaler_e prescaler) {
    uint32_t result = 0;
    switch (prescaler) {
        case UNI_HAL_SPI_PRESCALER_2:
            result = LL_SPI_BAUDRATEPRESCALER_DIV2;
            break;
        case UNI_HAL_SPI_PRESCALER_4:
            result = LL_SPI_BAUDRATEPRESCALER_DIV4;
            break;
        case UNI_HAL_SPI_PRESCALER_8:
            result = LL_SPI_BAUDRATEPRESCALER_DIV8;
            break;
        case UNI_HAL_SPI_PRESCALER_16:
            result = LL_SPI_BAUDRATEPRESCALER_DIV16;
            break;
        case UNI_HAL_SPI_PRESCALER_32:
            result = LL_SPI_BAUDRATEPRESCALER_DIV32;
            break;
        case UNI_HAL_SPI_PRESCALER_64:
            result = LL_SPI_BAUDRATEPRESCALER_DIV64;
            break;
        case UNI_HAL_SPI_PRESCALER_128:
            result = LL_SPI_BAUDRATEPRESCALER_DIV128;
            break;
        case UNI_HAL_SPI_PRESCALER_256:
            result = LL_SPI_BAUDRATEPRESCALER_DIV256;
            break;
        default:
            // unknown polarity
            break;
    }
    return result;
}

static uint32_t _uni_hal_spi_prescaler_div_get(uint32_t prescaler_ll) {
    uint32_t result = 0U;
    switch (prescaler_ll) {
        case LL_SPI_BAUDRATEPRESCALER_DIV2:
            result = 2U;
            break;
        case LL_SPI_BAUDRATEPRESCALER_DIV4:
            result = 4U;
            break;
        case LL_SPI_BAUDRATEPRESCALER_DIV8:
            result = 8U;
            break;
        case LL_SPI_BAUDRATEPRESCALER_DIV16:
            result = 16U;
            break;
        case LL_SPI_BAUDRATEPRESCALER_DIV32:
            result = 32U;
            break;
        case LL_SPI_BAUDRATEPRESCALER_DIV64:
            result = 64U;
            break;
        case LL_SPI_BAUDRATEPRESCALER_DIV128:
            result = 128U;
            break;
        case LL_SPI_BAUDRATEPRESCALER_DIV256:
            result = 256U;
            break;
        default:
            // unknown prescaler
            break;
    }
    return result;
}


//
// Private/init
//

static bool _uni_hal_spi_init_rcc(uni_hal_spi_context_t *ctx) {
    return uni_hal_rcc_clksrc_set(ctx->config.instance, ctx->config.clock_source)
           && uni_hal_rcc_clk_set(ctx->config.instance, true);
}

static bool _uni_hal_spi_init_gpio(uni_hal_spi_context_t *ctx) {
    bool result = true;

    if (ctx->config.pin_sck != NULL) {
        ctx->config.pin_sck->gpio_pull = UNI_HAL_GPIO_PULL_NO;
        ctx->config.pin_sck->gpio_type = UNI_HAL_GPIO_TYPE_ALTERNATE_PP;
        _uni_hal_spi_gpio_set_alternate(ctx->config.instance, ctx->config.pin_sck);
        result = uni_hal_gpio_pin_init(ctx->config.pin_sck) && result;
    }

    if (ctx->config.pin_miso != NULL) {
        ctx->config.pin_miso->gpio_pull = UNI_HAL_GPIO_PULL_NO;
        ctx->config.pin_miso->gpio_type = UNI_HAL_GPIO_TYPE_ALTERNATE_PP;
        _uni_hal_spi_gpio_set_alternate(ctx->config.instance, ctx->config.pin_miso);
        result = uni_hal_gpio_pin_init(ctx->config.pin_miso) && result;
    }

    if (ctx->config.pin_mosi != NULL) {
        ctx->config.pin_mosi->gpio_pull = UNI_HAL_GPIO_PULL_NO;
        ctx->config.pin_mosi->gpio_type = UNI_HAL_GPIO_TYPE_ALTERNATE_PP;
        _uni_hal_spi_gpio_set_alternate(ctx->config.instance, ctx->config.pin_mosi);
        result = uni_hal_gpio_pin_init(ctx->config.pin_mosi) && result;
    }

