Uni-Libraries/Uni.HAL/src/spi/uni_hal_spi_stm32h7.c
    if (ctx->config.pin_nss != NULL) {
        ctx->config.pin_nss->gpio_pull = UNI_HAL_GPIO_PULL_NO;
        ctx->config.pin_nss->gpio_init = true;
        ctx->config.pin_nss->gpio_type = ctx->config.nss_hard
                                             ? UNI_HAL_GPIO_TYPE_ALTERNATE_PP
                                             : UNI_HAL_GPIO_TYPE_OUT_PP;
        _uni_hal_spi_gpio_set_alternate(ctx->config.instance, ctx->config.pin_nss);
        result = uni_hal_gpio_pin_init(ctx->config.pin_nss) && result;
    }

    return result;
}


static bool _uni_hal_spi_init_irq(uni_hal_spi_context_t *ctx) {
    bool result = false;
    IRQn_Type irq = WWDG_IRQn;

    switch (ctx->config.instance) {
        case UNI_HAL_CORE_PERIPH_SPI_1:
            irq = SPI1_IRQn;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_2:
            irq = SPI2_IRQn;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_3:
            irq = SPI3_IRQn;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_4:
            irq = SPI4_IRQn;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_5:
            irq = SPI5_IRQn;
            break;
        case UNI_HAL_CORE_PERIPH_SPI_6:
            irq = SPI6_IRQn;
            break;
        default:
            break;
    }

    if (irq != WWDG_IRQn) {
        NVIC_SetPriority(irq, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 5, 0));
        NVIC_EnableIRQ(irq);
        result = true;
    }

    return result;
}


static bool _uni_hal_spi_init_dma(uni_hal_spi_context_t *ctx) {
    bool result = true;

    if (ctx->config.dma_tx != NULL) {
        result = result && uni_hal_dma_init(ctx->config.dma_tx);

        if (result) {
            uni_hal_dma_set_fifo_mode(ctx->config.dma_tx, false);
            uni_hal_dma_set_mode(ctx->config.dma_tx, UNI_HAL_DMA_MODE_NORMAL);
            uni_hal_dma_set_priority(ctx->config.dma_tx, UNI_HAL_DMA_PRIORITY_LOW);

            DMA_TypeDef *module = uni_hal_dma_stm32h7_get_module(ctx->config.dma_tx->config.instance);
            uint32_t stream = uni_hal_dma_stm32h7_get_channel(ctx->config.dma_tx->config.channel);

            LL_DMA_SetDataTransferDirection(module, stream, LL_DMA_DIRECTION_MEMORY_TO_PERIPH);
            LL_DMA_SetPeriphIncMode(module, stream, LL_DMA_PERIPH_NOINCREMENT);
            LL_DMA_SetMemoryIncMode(module, stream, LL_DMA_MEMORY_INCREMENT);
            LL_DMA_SetPeriphSize(module, stream, LL_DMA_PDATAALIGN_BYTE);
            LL_DMA_SetMemorySize(module, stream, LL_DMA_PDATAALIGN_BYTE);
            LL_DMA_SetPeriphRequest(module, stream, _uni_hal_spi_dma_request_tx_get(ctx->config.instance));

            LL_DMA_EnableIT_TC(module, stream);
            LL_DMA_EnableIT_TE(module, stream);
        }
    }

    if (ctx->config.dma_rx != NULL) {
        result = result && uni_hal_dma_init(ctx->config.dma_rx);

        if (result) {
            uni_hal_dma_set_fifo_mode(ctx->config.dma_rx, false);
            uni_hal_dma_set_mode(ctx->config.dma_rx, UNI_HAL_DMA_MODE_NORMAL);
            uni_hal_dma_set_priority(ctx->config.dma_rx, UNI_HAL_DMA_PRIORITY_LOW);

            DMA_TypeDef *module = uni_hal_dma_stm32h7_get_module(ctx->config.dma_rx->config.instance);
            uint32_t stream = uni_hal_dma_stm32h7_get_channel(ctx->config.dma_rx->config.channel);

            LL_DMA_SetDataTransferDirection(module, stream, LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
            LL_DMA_SetPeriphIncMode(module, stream, LL_DMA_PERIPH_NOINCREMENT);
            LL_DMA_SetMemoryIncMode(module, stream, LL_DMA_MEMORY_INCREMENT);
            LL_DMA_SetPeriphSize(module, stream, LL_DMA_PDATAALIGN_BYTE);
            LL_DMA_SetMemorySize(module, stream, LL_DMA_PDATAALIGN_BYTE);
            LL_DMA_SetPeriphRequest(module, stream, _uni_hal_spi_dma_request_rx_get(ctx->config.instance));

            LL_DMA_EnableIT_TC(module, stream);
            LL_DMA_EnableIT_TE(module, stream);
        }
    }

    return result;
}


static bool _uni_hal_spi_init_spi(uni_hal_spi_context_t *ctx) {
    bool result = false;

    SPI_TypeDef *instance = _uni_hal_spi_handle_get(ctx->config.instance);
    if (instance != NULL) {
        LL_SPI_InitTypeDef init_struct;
        LL_SPI_StructInit(&init_struct);
        init_struct.TransferDirection =  (ctx->config.mode == UNI_HAL_SPI_MODE_SLAVE) ? LL_SPI_SIMPLEX_RX : LL_SPI_FULL_DUPLEX;
        init_struct.Mode =  (ctx->config.mode == UNI_HAL_SPI_MODE_SLAVE) ? LL_SPI_MODE_SLAVE : LL_SPI_MODE_MASTER;
        init_struct.DataWidth =LL_SPI_DATAWIDTH_8BIT;
        init_struct.ClockPolarity =  _uni_hal_spi_polarity(ctx->config.polarity);
        init_struct.ClockPhase =  _uni_hal_spi_phase(ctx->config.phase);
        init_struct.NSS = LL_SPI_NSS_SOFT;
        if (ctx->config.nss_hard && ctx->config.pin_nss) {
            if (ctx->config.mode == UNI_HAL_SPI_MODE_MASTER) {
                init_struct.NSS = LL_SPI_NSS_HARD_OUTPUT;
            } else {
                init_struct.NSS = LL_SPI_NSS_HARD_INPUT;
            }
        }
        init_struct.BaudRate = _uni_hal_spi_prescaler(ctx->config.prescaler);
        init_struct.BitOrder = LL_SPI_MSB_FIRST;

        result = LL_SPI_Init(instance, &init_struct) == SUCCESS;
        if(result) {
            LL_SPI_SetFIFOThreshold(instance, LL_SPI_FIFO_TH_01DATA);
            LL_SPI_SetStandard(instance, LL_SPI_PROTOCOL_MOTOROLA);
            LL_SPI_SetNSSPolarity(instance, LL_SPI_NSS_POLARITY_LOW);

            if (ctx->config.crc_type != UNI_HAL_SPI_CRC_DISABLE)
            {
                LL_SPI_EnableCRC(instance);
                LL_SPI_EnableFullSizeCRC(instance);
                LL_SPI_SetCRCWidth(instance, LL_SPI_CRC_16BIT);

                const uint32_t tx_init = (ctx->config.crc_init == 0xFFFFU)
                                            ? LL_SPI_TXCRCINIT_ALL_ONES_PATTERN
                                            : LL_SPI_TXCRCINIT_ALL_ZERO_PATTERN;
                const uint32_t rx_init = (ctx->config.crc_init == 0xFFFFU)
                                            ? LL_SPI_RXCRCINIT_ALL_ONES_PATTERN
                                            : LL_SPI_RXCRCINIT_ALL_ZERO_PATTERN;

                LL_SPI_SetTxCRCInitPattern(instance, tx_init);
                LL_SPI_SetRxCRCInitPattern(instance, rx_init);

                LL_SPI_SetCRCPolynomial(instance, ctx->config.crc_polynomial);
            }
        }
    }

    return result;
}


//
// Public
//

bool uni_hal_spi_init(uni_hal_spi_context_t *ctx) {
    if (ctx != NULL && !uni_hal_spi_is_inited(ctx)) {
        bool result = _uni_hal_spi_init_rcc(ctx);
        result = result && _uni_hal_spi_init_gpio(ctx);
        result = result && _uni_hal_spi_init_irq(ctx);
        result = result && _uni_hal_spi_init_dma(ctx);
        result = result && _uni_hal_spi_init_spi(ctx);

        size_t index = _uni_hal_spi_index_get(ctx->config.instance);
        if (result && index != SIZE_MAX) {
            g_uni_hal_spi_ctx[index] = ctx;
            ctx->status.inited = true;
        }
    }

    return ctx->status.inited;
}


bool uni_hal_spi_is_inited(const uni_hal_spi_context_t *ctx) {
    return ctx != NULL && ctx->status.inited;
}


bool uni_hal_spi_is_busy(const uni_hal_spi_context_t *ctx) {
    return uni_hal_spi_is_inited(ctx) && ctx->status.in_process;
}


