Uni-Libraries/Uni.HAL/src/spi/uni_hal_spi_stm32h7.c
uint32_t uni_hal_spi_bitrate_get(uni_hal_spi_context_t *ctx) {
    uint32_t result = 0U;

    if (uni_hal_spi_is_inited(ctx) && (ctx->config.mode == UNI_HAL_SPI_MODE_MASTER)) {
        SPI_TypeDef *instance = _uni_hal_spi_handle_get(ctx->config.instance);
        if (instance != NULL) {
            const uint32_t clk_hz = uni_hal_rcc_clk_get_freq(ctx->config.instance);
            const uint32_t prescaler_ll = LL_SPI_GetBaudRatePrescaler(instance);
            const uint32_t div = _uni_hal_spi_prescaler_div_get(prescaler_ll);
            if (clk_hz > 0U && div > 0U) {
                result = clk_hz / div;
            }
        }
    }

    return result;
}


bool uni_hal_spi_receive(uni_hal_spi_context_t *ctx, uint8_t *data, uint32_t len) {
    return uni_hal_spi_transmitreceive(ctx, NULL, data, len);
}


bool uni_hal_spi_transceive_async(uni_hal_spi_context_t *ctx, const uint8_t *data_rx, const uint8_t *data_tx,
                                  uint32_t len) {
    bool result = false;
    if (uni_hal_spi_is_inited(ctx) && len > 0U && (data_rx || data_tx)) {
        ctx->status.in_process = true;
        ctx->status.last_rx_data = (uint8_t *) data_rx;
        ctx->status.last_len = len;

        if (!ctx->config.nss_hard) {
            uni_hal_gpio_pin_set(ctx->config.pin_nss, false);
        }

        SPI_TypeDef *instance = _uni_hal_spi_handle_get(ctx->config.instance);

        // set DMA source and destination
        if (data_rx != NULL) {
            uni_hal_core_cm7_dcache_invalidate((void *) data_rx, len);
            DMA_TypeDef *dma_rx_module = uni_hal_dma_stm32h7_get_module(ctx->config.dma_rx->config.instance);
            uint32_t dma_rx_stream = uni_hal_dma_stm32h7_get_channel(ctx->config.dma_rx->config.channel);

            LL_DMA_ConfigAddresses(dma_rx_module, dma_rx_stream, LL_SPI_DMA_GetRxRegAddr(instance), (uint32_t) data_rx,
                                   LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
            LL_DMA_SetDataLength(dma_rx_module, dma_rx_stream, len);
            LL_DMA_EnableStream(dma_rx_module, dma_rx_stream);

            LL_SPI_EnableDMAReq_RX(instance);
        }

        if (data_tx != NULL) {
            uni_hal_core_cm7_dcache_clean((void *) data_tx, len);
            DMA_TypeDef *dma_tx_module = uni_hal_dma_stm32h7_get_module(ctx->config.dma_tx->config.instance);
            uint32_t dma_tx_stream = uni_hal_dma_stm32h7_get_channel(ctx->config.dma_tx->config.channel);

            LL_DMA_ConfigAddresses(dma_tx_module, dma_tx_stream, (uint32_t) data_tx, LL_SPI_DMA_GetTxRegAddr(instance),
                                   LL_DMA_DIRECTION_MEMORY_TO_PERIPH);
            LL_DMA_SetDataLength(dma_tx_module, dma_tx_stream, len);
            LL_DMA_EnableStream(dma_tx_module, dma_tx_stream);

            LL_SPI_EnableDMAReq_TX(instance);
        }

        // enable
        LL_SPI_DisableMasterRxAutoSuspend(instance);
        LL_SPI_SetTransferSize(instance, len);
        LL_SPI_EnableIT_EOT(instance);
        LL_SPI_Enable(instance);
        if (ctx->config.mode == UNI_HAL_SPI_MODE_MASTER) {
            LL_SPI_StartMasterTransfer(instance);
        }

        result = true;
    }
    return result;
}


bool uni_hal_spi_transmit(uni_hal_spi_context_t *ctx, const uint8_t *data, uint32_t len) {
    bool result = false;
    if (uni_hal_spi_is_inited(ctx) && data && len > 0U) {
        ctx->status.in_process = true;
        if (!ctx->config.nss_hard) {
            uni_hal_gpio_pin_set(ctx->config.pin_nss, false);
        }

        result = uni_hal_spi_transmitreceive(ctx, data, NULL, len);
        if (!ctx->config.nss_hard) {
            uni_hal_gpio_pin_set(ctx->config.pin_nss, true);
        }
        ctx->status.in_process = false;
    }
    return result;
}


bool uni_hal_spi_transmitreceive(uni_hal_spi_context_t *ctx, const uint8_t *tx_data, uint8_t *rx_data, uint32_t len) {
    bool result = false;
    uint8_t data_rx;

    if (uni_hal_spi_is_inited(ctx) != false) {
        SPI_TypeDef *instance = _uni_hal_spi_handle_get(ctx->config.instance);
        if (instance != NULL) {
            _uni_hal_spi_clear_flags(ctx->config.instance);

            LL_SPI_DisableGPIOControl(instance);
            LL_SPI_DisableMasterRxAutoSuspend(instance);
            LL_SPI_SetTransferSize(instance, len);

            LL_SPI_Enable(instance);
            if (ctx->config.mode == UNI_HAL_SPI_MODE_MASTER) {
                LL_SPI_StartMasterTransfer(instance);
            }


            size_t idx_tx = 0U;
            size_t idx_rx = 0U;
            while (idx_tx < len) {
                if (LL_SPI_IsActiveFlag_TXP(instance) != 0U) {
                    LL_SPI_TransmitData8(instance, (tx_data != NULL) ? tx_data[idx_tx] : (uint8_t) 0U);
                    idx_tx++;
                }
                if (idx_rx < len && (LL_SPI_IsActiveFlag_RXP(instance) != 0U)) {
                    data_rx = LL_SPI_ReceiveData8(instance);
                    if (rx_data != NULL) {
                        rx_data[idx_rx] = data_rx;
                    }
                    idx_rx++;
                }
            }

            while (LL_SPI_IsActiveFlag_EOT(instance) == 0U) {
            }
            LL_SPI_Disable(instance);
            _uni_hal_spi_clear_flags(ctx->config.instance);

            result = true;
        }
    }

    return result;
}


bool uni_hal_spi_set_prescaler(uni_hal_spi_context_t *ctx, uni_hal_spi_prescaler_e prescaler) {
    bool result = false;
    if (uni_hal_spi_is_inited(ctx) && ctx->config.prescaler != prescaler) {
        ctx->config.prescaler = prescaler;
        LL_SPI_SetBaudRatePrescaler(_uni_hal_spi_handle_get(ctx->config.instance), _uni_hal_spi_prescaler(prescaler));
        result = true;
    }
    return result;
}




//
// IRQ
//

bool SPIx_IRQHandler(uni_hal_spi_context_t *ctx, SPI_TypeDef *instance) {
    bool high_priority_woken = false;

    if (!ctx->config.nss_hard) {
        uni_hal_gpio_pin_set(ctx->config.pin_nss, true);
    }

    if(ctx->status.last_rx_data != NULL) {
        uni_hal_core_cm7_dcache_invalidate(ctx->status.last_rx_data, ctx->status.last_len);
    }

    LL_SPI_ClearFlag_EOT(instance);
    LL_SPI_ClearFlag_TXTF(instance);
    LL_SPI_ClearFlag_UDR(instance);
    LL_SPI_ClearFlag_CRCERR(instance);

    LL_SPI_Disable(instance);

    /* ES0392 #2.22.4: mask TXP/TXC while disabled */
    LL_SPI_DisableIT_TXP(instance);
    LL_SPI_DisableIT_EOT(instance);

    LL_SPI_DisableDMAReq_RX(instance);
    LL_SPI_DisableDMAReq_TX(instance);

    ctx->status.in_process = false;
    if(ctx->status.callback) {
        high_priority_woken = ctx->status.callback(ctx->status.callback_cookie);
    }

    return high_priority_woken;
}


void SPI1_IRQHandler() {
    traceISR_ENTER();
    portYIELD_FROM_ISR(SPIx_IRQHandler(g_uni_hal_spi_ctx[0], SPI1));
}

void SPI2_IRQHandler() {
    traceISR_ENTER();
    portYIELD_FROM_ISR(SPIx_IRQHandler(g_uni_hal_spi_ctx[1], SPI2));
}

void SPI3_IRQHandler() {
    traceISR_ENTER();
    portYIELD_FROM_ISR(SPIx_IRQHandler(g_uni_hal_spi_ctx[2], SPI3));
}

void SPI4_IRQHandler() {
    traceISR_ENTER();
    portYIELD_FROM_ISR(SPIx_IRQHandler(g_uni_hal_spi_ctx[3], SPI4));
}

void SPI5_IRQHandler() {
    traceISR_ENTER();
    portYIELD_FROM_ISR(SPIx_IRQHandler(g_uni_hal_spi_ctx[4], SPI5));
}

void SPI6_IRQHandler() {
    traceISR_ENTER();
    portYIELD_FROM_ISR(SPIx_IRQHandler(g_uni_hal_spi_ctx[5], SPI6));
}
